OdDbBaseHostAppServices.getSubstituteFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdFontType)
\details
Returns the font to be used when the specified font is not found.
\param fontName [in]  Font name.
\param fontType [in]  Font type.
\remarks
fontType must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
The default implementation of this function calls getAlternateFontName for
fonts that are not of type kFontTypeShape or kFontTypeBig. When they are,
and empty string is returned.
Client code could override this function to perform custom substitution
for these types of fonts.
\sa
Font Handling

OdDbBaseHostAppServices.getPreferableFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdFontType)
\details
Returns the preferable font name for the specified font name and type.
\param fontName [in]  Font name.
\param fontType [in]  Font type.
\remarks
This function is called as the first step in the process of resolving a font file.
The default implementation tries to locate a font mapping file by calling
getFontMapFileName, and substitutes the font name based on the contents of this
file.
fontType must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling